# Splitting Individual Attributes

In [1]:
import pandas as pd

In [2]:
A1_Z1=pd.DataFrame({"variable":["Abc 123","Def 456","Ghi 789"]}) 
A1_Z1

  variable
0  Abc 123
1  Def 456
2  Ghi 789

In [3]:
A1_Z1["variable"].str.split(" ")

0    [Abc, 123]
1    [Def, 456]
2    [Ghi, 789]
Name: variable, dtype: object

In [4]:
A1_Z1["variable"].str.split(" ",expand=True)

     0    1
0  Abc  123
1  Def  456
2  Ghi  789

In [5]:
A1_Z1.rename(columns={0:"Alphabets",1:"Numbers"})

  variable
0  Abc 123
1  Def 456
2  Ghi 789

In [6]:
A2_Z2=pd.DataFrame({"Variable":["20 March 2022"]})
A2_Z2

        Variable
0  20 March 2022

In [7]:
A2_Z2["Variable"].str.split(" ",expand=True)

    0      1     2
0  20  March  2022

In [8]:
A3=A2_Z2["Variable"].str.split(" ",expand=True)
A3

    0      1     2
0  20  March  2022

In [9]:
A3.rename(columns={0:"Date",1:"Month",2:"Year"})

  Date  Month  Year
0   20  March  2022

# Splitting Address

In [10]:
A3_Z3=pd.DataFrame({'Variable':['345th ave street,church road,btm layout,banglore,karnataka,500136']})
A3_Z3

                                            Variable
0  345th ave street,church road,btm layout,banglo...

In [11]:
A4=A3_Z3['Variable'].str.split(',',expand=True)

In [12]:
A4

                  0            1           2         3          4       5
0  345th ave street  church road  btm layout  banglore  karnataka  500136

In [13]:
A4.rename(columns={0:'Street',1:'road',2:'layout',3:'City',4:'State',5:'Pincode',})

             Street         road      layout      City      State Pincode
0  345th ave street  church road  btm layout  banglore  karnataka  500136